package Shortscat.src;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
    //  1 = ctrl + / - Автоматический комментарий

    //  alt + tab - Можно переключать и автоматически открывать классы или проекты

//    ctrl + alt + l - форматирование кода
    // alt + ctrl + i - выравнивание кода
    // ctrl + alt + t - можно автоматически создавать циклы ставить скобки и тд.
//                          Shortcuts От It-proger
//    Ctrl + Space — стандартное автодополнение кода;
//    Ctrl + Shift + Space — умное автодополнение кода;
//    Двойной Shift — искать везде;
//    Alt + Enter — показать возможные варианты исправления;
//    Alt + Ins — генерация кода (геттеры, сеттеры, конструктор и т.д.);
//    Ctrl + P — информация о параметре (применяется на аргументе метода при вызове);
//    Ctrl + W — расширить область выделения;
//    Ctrl + Shift + W — уменьшить область выделения;
//    Ctrl + E — список недавних файлов;
//    Shift + F6 — переименовать (переменную, функцию и т.д.);
//    Ctrl + R — сделать замену;
//    Ctrl + Q — быстрый просмотр документации;
//    Ctrl + / — закомментировать/раскомментировать строку;
//    Ctrl + Shift + / — закомментировать/раскомментировать блок кода;
//    Ctrl + Alt + I — автоматически добавить нужные отступы для строки/строк;
//    Ctrl + Shift + A — найти действие;
//    Shift + Alt + ↑ — переместить выбранные строки вверх;
//    Shift + Alt + ↓ — переместить выбранные строки вниз;
//    Ctrl + Shift + F7 — показать все упоминания в файле;
//    Ctrl + Alt + L — реформатировать код.


}